<template>
  <view class="container">
    <view class="wrapper">
      <view class="main">
        <view class="title">注册云店协议</view>
        <view class="p-wrap2">
          本服务协议是{{ MiniName }}的经营者{{
            EntName
          }}（以下简称为“本公司”）与入驻云店的商户（以下简称为“您”），共同缔结的对双方具有约束力的有效契约。您在申请注册流程中点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读，充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款，粗体部分您应重点阅读。
        </view>
        <view class="title-item">一、合作事项</view>
        <view class="p-wrap">
          1、本公司提供云店小程序的软件服务、产品信息和活动政策，您可通过云店小程序为顾客提供商品销售、推广活动和订单售后等服务。
        </view>
        <view class="p-wrap">
          2、本公司与授权渠道商合作，经过授权渠道商的邀请链接注册的云店同样具备子店铺的管理权限。
        </view>
        <view class="p-wrap">
          3、云店的子店铺注册成功后，注册手机号默认为该网点管理负责人，可以登录门店助手小程序后台，经营和管理自己的云店铺商城。
        </view>
        <view class="title-item">二、入驻商户基本条件</view>
        <view class="p-wrap">
          1、您应当具备中华人民共和国法律规定的完全民事权利能力和民事行为能力，能够独立承担民事责任。
        </view>
        <view class="p-wrap">
          2、有良好的合作意愿，能提供优质的商品售卖服务，主动学习品牌产品知识，积极参与本公司组织的线上线下培训服务，参与本公司策划的市场营销活动，保证双方合作的顺利进行。
        </view>
        <view class="p-wrap fw-bold">
          3、入驻的商户在涉及资金管理的环节，平台有权利要求入驻商户提供合法有效的证件，个人商户应提供身份证或手持身份证照片等信息，个体工商户或企业类应提供合法有效的营业执照及其他经营许可。
        </view>
        <view class="p-wrap">
          4、您须保证所提交的所有材料真实、准确、合法、有效。如相关材料有变更或更新时应及时通知平台，任何原因导致不符合本协议所规定入驻条件的，本公司有权单方全部或部分限制云店经营，直至终止本协议。
        </view>
        <view class="title-item">三、门店账户的注册与使用</view>
        <view class="p-wrap">
          1、门店帐号一经注册成功，
          <text class="fw-bold">
            您的账户不得以任何形式转让，否则本公司有权追究您的违约责任，且由此产生的一切责任均由您承担。
          </text>
        </view>
        <view class="p-wrap">
          2、注册成功后您的账户和密码由您自行负责保管，您应当对该账号进行的所有活动和事件负法律责任，账户下其他管理员的操作，视为您授权其进行管理。
        </view>
        <view class="p-wrap">
          3、为保障平台服务的合法性及安全性，您不得违反本协议约定将您的账号用于其他目的，否则，本公司有权随时单方限制或终止向您提供云店服务，且未经本公司同意您不得再次使用本服务。
        </view>
        <view class="p-wrap">
          4、若您发现有他人冒用或盗用您的帐户及密码、或任何其他未经您合法授权或其他可能导致您账户遭窃、遗失的情形时，建议您应立即以有效方式通知本公司（包括但不限于提供您的身份信息和相关身份资料、相关事实情况及您的要求等）。本公司收到您的有效请求并核实身份后，会根据不同情况采取相应措施。
          <text class="fw-bold">
            若您提供的信息不完全，导致本公司无法核实您的身份或无法判断您的需求等，而导致本公司无法进行及时处理，给您带来的损失，您应自行承担。同时，您理解本公司对您的请求采取措施需要合理期限，且本公司应您请求而采取的措施可能无法避免或阻止侵害后果的形成或扩大，
          </text>
          由于他人行为给您造成的损失，本公司不承担任何责任。
        </view>
        <view class="title-item">四、云店合规经营规则</view>
        <view class="p-wrap">
          1、在本协议第一条规定范围内，您可自行开拓市场与发展业务，以合法经营方式提升云店铺的销售业绩，但不得以欺诈、胁迫等不正当手段损害客户或平台的利益与声誉。
        </view>
        <view class="p-wrap">
          2､云店平台只提供线上售卖商品信息，但实际供货和配送、售后服务均由您自行负责（平台一件代发类商品除外），如在售后服务中跟客户出现沟通问题，您可以咨询本公司客服，本公司根据实际情况给予技术上的帮助与协调。
        </view>
        <view class="p-wrap">
          3、您必须保证其所经营销售的产品均为合法渠道的正品正货，必要时需要开具销售发票。你在云店所有经营活动必须完全符合中国有关法律、法规、行政规章等的规定。如您违反上述规定给本平台带来任何损害，您应承担所有法律责任并赔偿由此给平台和客户造成的损失；
        </view>
        <view class="p-wrap">
          4、您与客户
          <text class="fw-bold">
            交易完成后，客户自提提货核销后，平台系统会在24小时内给您的门店账户结帐，快递类订单则是确认收货后第8天（过了退货期）进行结算。
          </text>
          若交易已经完成，即客户确认收货并且在7天内无退货申请，平台系统会默认双方均满意此次交易。后续如有问题出现，则需要您与其客户自行商议并解决，如出现双方无法达成共识，亦可选择由平台协商解决。
        </view>
        <view class="p-wrap">5、入驻云店的商户需保证参与全网积分活动、会员经营活动和商品促销活动。</view>
        <view class="title-item">五、云店收款和提现规则</view>
        <view class="p-wrap">
          1、云店收款及结算服务：是指买卖双方使用本系统，交易款由买方通过系统集成的第三方支付网关以电子货币的方式支付到本公司在第三方支付网关（当前仅支持微信支付）的账户，该笔货款将记账在您的云店账户余额里面，可以自行申请提现到您的微信零钱账户。
          <text class="fw-bold">
            第三方支付网关会因此向您单独收取费率，当前默认费率为{{
              rate
            }}%，如有调整以平台公告为准，您理解并同意，该费用是第三方支付网关基于其向您支付服务所收取的费用，与本公司向您提供的本项服务无关。
          </text>
        </view>
        <view class="p-wrap">
          2、
          <text class="fw-bold">
            余额提现：门店可提现金额以平台记账为准，当前仅支持提现到已实名认证的个人微信号，单次及单日限额最多5000元，每日最多可提现10次，
          </text>
          若由于微信号异常、微信号被限制打款、微信号未实名等情况导致的提现失败均由您自行承担。除本条约定外，本公司暂不提供其他提现方式。
        </view>
        <view class="p-wrap">
          3、账单明细查询：平台将对您在本系统中的所有操作进行记录，不论该操作之目的最终是否实现。您可以在本系统中实时查询其商户账户名下的收入和提现记录，若您认为记录有误的，您可向本公司提出异议，本公司将向您提供按照您的指示操作产生的提现记录。并且您认同此记录为您交易记录的最终依据，不再对此有异议。另外，您理解并同意您最终收到款项的服务是由您提供的微信账户对应的服务方提供的，您需向该服务方请求查证。
        </view>
        <view class="p-wrap">
          4、异常交易处理：您使用本服务时，可能由于微信本身、其他第三方系统问题或其他不可抗力因素，造成暂时无法提供本服务，此情形下，本公司无需承担任何责任。
        </view>
        <view class="p-wrap">
          5、根据我国法律及税收政策，平台所有商户有义务就其在平台上的劳务报酬所得按时、足额的缴纳个人所得税。因《个人所得税代扣代缴暂行办法》已于2016年5月29日全文失效，且替代性政策文件尚未出台，故本公司暂时采取由您自行申报并缴纳税款的形式执行。本公司将随时根据税务部门的最新政策或指导意见，即时调整商户个人所得税税款缴纳问题的执行方式。您在此确认如下，本公司保留有如下权利：若相关税务部门要求本公司提供商户账户信息以核实商户自行申报的相关数额，平台有权不经商户同意而进行披露，并根据国家法律配合相关税务部门的其他合法要求。
        </view>
        <view class="p-wrap">
          6、在您与第三方发生交易纠纷时，您授权本公司自行判断并决定将争议款项的全部或部分支付给交易一方或双方。
        </view>
        <view class="p-wrap">
          7、在提现等本公司认为需要实名认证的环节，您应无条件配合平台进行实名认证，否则平台有权拒绝您的提现要求。您提供的账户应为您的真实账户，因您提供的提现账户有误导致平台无法正常向您的提现账户汇款或汇款错误、丢失的，后果由您自行承担，本公司不承担任何责任。
        </view>
        <view class="p-wrap">
          8、在您决定不再使用该账户时，您应将该收款账户下所对应的可用款项全部提现，并向本公司申请删除该账户。您同意，若您丧失全部或部分民事权利能力或民事行为能力，平台有权根据有效法律文书（包括但不限于生效的法院判决、生效的遗嘱等）处置您账户的相关款项。
        </view>
        <view class="title-item">六、免责条款</view>
        <view class="p-wrap">
          1、您知晓并同意您的用户有权在云店商城对您发布的信息进行评论，就该评论中可能包含的负面信息给您造成的不利影响由您自行承担，本公司不承担任何责任。
        </view>
        <view class="p-wrap">
          2､您确保所输入的您的资料无误，如果因资料错误造成平台异常交易发生时，无法及时通知您相关交易后续处理方式的，本公司不承担任何损害赔偿责任。
        </view>
        <view class="p-wrap">
          3、您理解并同意：为了向您提供更完善的服务，本公司合作的第三方技术公司有权定期或不定期地对提供本服务的平台或相关设备进行检修、维护、升级等，此类情况可能会造成相关服务在合理时间内中断或暂停的，若由此给您造成损失的，您同意放弃追究本公司及第三方技术公司的责任。
        </view>
        <view class="p-wrap">
          4、您理解并同意：在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，本公司将努力在第一时间与相关单位配合，及时进行修复，若由此给您造成损失的，您同意放弃追究本公司的责任。
        </view>
        <view class="title-item">七、协议的终止</view>
        1、【商户发起的终止】您有权通过以下任一方式终止本协议：
        <view class="p-wrap">
          （1）您明示不再继续使用本平台服务，并向本公司申请销除账户，且经本公司审核同意销除的；
        </view>
        <view class="p-wrap">（2）变更事项生效前您停止使用并明示不愿接受变更事项的；</view>
        2、【本公司发起的终止】出现以下情况时，本公司可以以本协议所约定的方式通知您以终止本协议：
        <view class="p-wrap">（1）您违反本协议约定，本公司依据违约条款终止本协议的；</view>
        <view class="p-wrap">
          （2）您盗用他人账户、发布违禁信息、骗取他人财物、发布或销售假冒伪劣/侵权商品、扰乱市场秩序、采取不正当手段谋利、欺诈、侵犯他人合法权益或其他严重违法违约行为的，本公司依据平台规则对您的账户予以查封的；
        </view>
        <view class="p-wrap">
          （3）除上述情形外，因您多次违反本公司平台规则相关规定且情节严重，本公司依据平台规则对您的账户予以查封的；
        </view>
        <view class="p-wrap">（4）您的账户被本公司依据本协议回收的；</view>
        <view class="p-wrap">
          （5）因您违反本协议相关规定，被本公司终止提供服务的，后您再一次直接或间接或以他人名义注册商户账户，本公司有权再次单方面终止向您提供服务；
        </view>
        <view class="p-wrap">
          （6）本公司发现您注册数据中主要内容（身份信息、联系方式等）是虚假的，本公司有权随时终止向您提供服务；
        </view>
        <view class="title-item">八、附则</view>
        <view class="p-wrap">
          1、当您按照注册页面提示填写信息、阅读并同意本协议完成全部注册后，即表示您已充分阅读、理解并接受本协议的全部内容，并与本协议达成一致，成为入驻商户，如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。
        </view>
        <view class="p-wrap">
          2、本公司有权在必要时单方修改本协议或上述内容，相关内容变更后，如果您继续使用本服务，即视为您已接受修改后的相关内容。如果您不接受修改后的相关内容，应当停止使用相关服务。
        </view>
        <view class="p-wrap">
          3、本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。
        </view>
        <view class="p-wrap">
          4、因本协议产生之争议，双方应首先协商解决；双方未能以诚意协商解决的，任何一方均应将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。
        </view>
        <view class="p-wrap">
          5、本协议的拟定、解释均以中文为准。除双方另有约定外，任何有关本协议的翻译不得作为解释本协议或判定双方当事人意图之依据。
        </view>
        <view class="p-wrap">
          6、如本协议的任何条款被视作无效或无法执行，则上述条款可被分离，其余条款则仍具有法律效力。
        </view>
        <view class="p-wrap">
          7、本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。
        </view>
        <view style="padding: 10rpx 0">
          <text class="title-item">【</text>
          审慎提醒
          <text class="title-item">】</text>
        </view>
        <view class="p-wrap">
          如您点击“同意”，则本协议将立即生效，并构成您和{{ EntName }}及其经营的{{ MiniName }}之间有约束力的法律文件。
        </view>
        <view class="p-wrap">请您再次确认您已全部阅读并充分理解上述协议。</view>
      </view>
    </view>
  </view>
</template>

<script>
export default {
  data() {
    return {
      MiniName: '',
      EntName: '',
      rate: 0.6
    }
  },
  async onLoad(option) {
    this.rate = option.m === '10003644' || option.m === '10003911' || option.m === '10003361' ? 0.2 : 0.6
    this.EntName = option.EntName || ''
    this.MiniName = option.MiniName || ''
  }
}
</script>

<style lang="scss" scoped>
.container {
  background-color: #fff;
}
.main {
  width: 100%;
  padding: 20rpx 40rpx;
  box-sizing: border-box;
  line-height: 1.5;
  .title {
    text-align: center;
    padding: 20rpx 0;
  }
  .p-wrap {
    text-indent: 2em;
    text-align: justify;
  }
  .p-wrap2 {
    text-indent: 2em;
    text-align: justify;
  }
  .title-item {
    padding: 10rpx 0;
    font-size: 32rpx;
    font-weight: bold;
  }
}
</style>
